<template>

    <!-- #worldgroupactivity - main hash tag

        брать новости из паблииков, приватов

        юэкграунд фото рисует ии по тексту

        справа в углу кнопка озвучивания текста (заебался читать) ии, на бэкграунде избранные сообщения комментаторов




        ui


        -->

    <div v-if="newslist" class="loading">
        <!-- make random and add second game -->
        Loading... Please  <a href="https://mrdoob.com/projects/chromeexperiments/google-gravity/">play with me</a> <!--for more fun.-->
    </div>

    <div class="newssearch">
        <form class="form" ref="msgFormRef" v-on:submit.prevent="onSubmit">
            <input type="text" class="newssearchinput" v-model="sentmessageinput" value="oppo realme ram 8gb cam 120mpx " placeholder="searching .." />
            <input type="submit" class="newssearchinput" @click="msgSend" style="display: none" />
            <a class="cursorimage">></a>
            <label class="cursor"></label>
        </form>
    </div>

    <div id="newsWrapper">
        <div id="newsBody" v-for="news in newslist" :key="news.tag">
            <!--<img id="newsBackgroundImg" :src="require(`../assets/${news.image}`)" alt="" />-->
            <img id="newsBackgroundImg" src="../assets/Cisco.jpg" alt="" />
            <!--<router-link class="newsContent" :to="{name: 'news', params: { id: news.id}}">-->
            <router-link class="newsContent">
                {{news.title}}<br />
                {{news.tag}}<br />
                {{news.date}}<br />
                {{news.reference.slice(0, 50)}} ..<br />
                {{news.content.slice(0, 1200)}} ..<br />
            </router-link>
        </div>
    </div>
</template>

<style >
    /*input*/
    .newssearchinput {
        background-color: #00000000;
        width: 100%;
        border: none;
        position: absolute;
        color: white;
        font-size: 1.2em;
        margin-left: 1em;
        left: 0.6em;
    }

    .newssearch {
        padding: 1em;
        width: 100%;
    }

    #newsBackgroundImg {
        height: 10em;
        width: 100%;
        object-fit: cover;
        opacity: 0.2;
        z-index: 2;
        position: absolute;
        padding: 0.5em;
        border-radius: 25px;
    }

    a {
        z-index: 4;
        position: relative;
    }

    #newsWrapper {
        height: 100%;
        margin: 0.5em;
        top: 6em;
        position: relative;
        margin-top: -7em;
        overflow: scroll;
    }

    #newsBody {
        margin-top: 1em;
        height: 8.9em;
        overflow:hidden;
    }

    .newsContent {
        margin-right: 2em;
        text-align: justify;
        color: #e0e0e0;
        text-decoration: none;
        font-size: 0.9em;
        display: block;
        line-height: 120%;
        padding-top: 2em;
        padding-left: 2em;
        padding-right: 2em;
    }
</style>

<script lang="ts">
    import { defineComponent } from 'vue';

    export default defineComponent({ 
        data(): Data {
            return {
                loading: false,
                newslist: [
                    { id: 0, title: "На работу в компанию KnowBe4 устроился северокорейский хакер", tag: "#worldgroupactivity", date: "25072024", content: "KnowBe4 сообщает, что все началось с того, что ее команда безопасности обнаружила подозрительную активность, исходящую с рабочей станции недавно нанятого инженера-программиста Однако быстро выяснилось, что на самом деле инсайдер использовал Raspberry Pi для загрузки вредоносного ПО, манипулирования файлами сессий и выполнения неавторизованного ПО. Так как инсайдер пытался развернуть на машине инфостилер, нацеленный на данные, хранящиеся в браузерах, предполагается, что он надеялся извлечь информацию, оставшуюся в системе от прошлого владельца.", reference: "xaker.ru", image: "../assets/logo.svg" },
                    { id: 0, title: "На работу в компанию KnowBe4 устроился северокорейский хакер", tag: "#worldgroupactivity", date: "25072024", content: "KnowBe4 сообщает, что все началось с того, что ее команда безопасности обнаружила подозрительную активность, исходящую с рабочей станции недавно нанятого инженера-программиста Однако быстро выяснилось, что на самом деле инсайдер использовал Raspberry Pi для загрузки вредоносного ПО, манипулирования файлами сессий и выполнения неавторизованного ПО. Так как инсайдер пытался развернуть на машине инфостилер, нацеленный на данные, хранящиеся в браузерах, предполагается, что он надеялся извлечь информацию, оставшуюся в системе от прошлого владельца.", reference: "xaker.ru", image: "../assets/logo.svg" },
                    { id: 0, title: "На работу в компанию KnowBe4 устроился северокорейский хакер", tag: "#worldgroupactivity", date: "25072024", content: "KnowBe4 сообщает, что все началось с того, что ее команда безопасности обнаружила подозрительную активность, исходящую с рабочей станции недавно нанятого инженера-программиста Однако быстро выяснилось, что на самом деле инсайдер использовал Raspberry Pi для загрузки вредоносного ПО, манипулирования файлами сессий и выполнения неавторизованного ПО. Так как инсайдер пытался развернуть на машине инфостилер, нацеленный на данные, хранящиеся в браузерах, предполагается, что он надеялся извлечь информацию, оставшуюся в системе от прошлого владельца.", reference: "xaker.ru", image: "../assets/logo.svg" },
                    { id: 0, title: "На работу в компанию KnowBe4 устроился северокорейский хакер", tag: "#worldgroupactivity", date: "25072024", content: "KnowBe4 сообщает, что все началось с того, что ее команда безопасности обнаружила подозрительную активность, исходящую с рабочей станции недавно нанятого инженера-программиста Однако быстро выяснилось, что на самом деле инсайдер использовал Raspberry Pi для загрузки вредоносного ПО, манипулирования файлами сессий и выполнения неавторизованного ПО. Так как инсайдер пытался развернуть на машине инфостилер, нацеленный на данные, хранящиеся в браузерах, предполагается, что он надеялся извлечь информацию, оставшуюся в системе от прошлого владельца.", reference: "xaker.ru", image: "../assets/logo.svg" },
                    { id: 0, title: "На работу в компанию KnowBe4 устроился северокорейский хакер", tag: "#worldgroupactivity", date: "25072024", content: "KnowBe4 сообщает, что все началось с того, что ее команда безопасности обнаружила подозрительную активность, исходящую с рабочей станции недавно нанятого инженера-программиста Однако быстро выяснилось, что на самом деле инсайдер использовал Raspberry Pi для загрузки вредоносного ПО, манипулирования файлами сессий и выполнения неавторизованного ПО. Так как инсайдер пытался развернуть на машине инфостилер, нацеленный на данные, хранящиеся в браузерах, предполагается, что он надеялся извлечь информацию, оставшуюся в системе от прошлого владельца.", reference: "xaker.ru", image: "../assets/logo.svg" },
                    { id: 0, title: "На работу в компанию KnowBe4 устроился северокорейский хакер", tag: "#worldgroupactivity", date: "25072024", content: "KnowBe4 сообщает, что все началось с того, что ее команда безопасности обнаружила подозрительную активность, исходящую с рабочей станции недавно нанятого инженера-программиста Однако быстро выяснилось, что на самом деле инсайдер использовал Raspberry Pi для загрузки вредоносного ПО, манипулирования файлами сессий и выполнения неавторизованного ПО. Так как инсайдер пытался развернуть на машине инфостилер, нацеленный на данные, хранящиеся в браузерах, предполагается, что он надеялся извлечь информацию, оставшуюся в системе от прошлого владельца.", reference: "xaker.ru", image: "../assets/logo.svg" },
                    { id: 0, title: "На работу в компанию KnowBe4 устроился северокорейский хакер", tag: "#worldgroupactivity", date: "25072024", content: "KnowBe4 сообщает, что все началось с того, что ее команда безопасности обнаружила подозрительную активность, исходящую с рабочей станции недавно нанятого инженера-программиста Однако быстро выяснилось, что на самом деле инсайдер использовал Raspberry Pi для загрузки вредоносного ПО, манипулирования файлами сессий и выполнения неавторизованного ПО. Так как инсайдер пытался развернуть на машине инфостилер, нацеленный на данные, хранящиеся в браузерах, предполагается, что он надеялся извлечь информацию, оставшуюся в системе от прошлого владельца.", reference: "xaker.ru", image: "../assets/logo.svg" },
                    { id: 0, title: "На работу в компанию KnowBe4 устроился северокорейский хакер", tag: "#worldgroupactivity", date: "25072024", content: "KnowBe4 сообщает, что все началось с того, что ее команда безопасности обнаружила подозрительную активность, исходящую с рабочей станции недавно нанятого инженера-программиста Однако быстро выяснилось, что на самом деле инсайдер использовал Raspberry Pi для загрузки вредоносного ПО, манипулирования файлами сессий и выполнения неавторизованного ПО. Так как инсайдер пытался развернуть на машине инфостилер, нацеленный на данные, хранящиеся в браузерах, предполагается, что он надеялся извлечь информацию, оставшуюся в системе от прошлого владельца.", reference: "xaker.ru", image: "../assets/logo.svg" },
                    { id: 0, title: "На работу в компанию KnowBe4 устроился северокорейский хакер", tag: "#worldgroupactivity", date: "25072024", content: "KnowBe4 сообщает, что все началось с того, что ее команда безопасности обнаружила подозрительную активность, исходящую с рабочей станции недавно нанятого инженера-программиста Однако быстро выяснилось, что на самом деле инсайдер использовал Raspberry Pi для загрузки вредоносного ПО, манипулирования файлами сессий и выполнения неавторизованного ПО. Так как инсайдер пытался развернуть на машине инфостилер, нацеленный на данные, хранящиеся в браузерах, предполагается, что он надеялся извлечь информацию, оставшуюся в системе от прошлого владельца.", reference: "xaker.ru", image: "../assets/logo.svg" },
                    { id: 0, title: "На работу в компанию KnowBe4 устроился северокорейский хакер", tag: "#worldgroupactivity", date: "25072024", content: "KnowBe4 сообщает, что все началось с того, что ее команда безопасности обнаружила подозрительную активность, исходящую с рабочей станции недавно нанятого инженера-программиста Однако быстро выяснилось, что на самом деле инсайдер использовал Raspberry Pi для загрузки вредоносного ПО, манипулирования файлами сессий и выполнения неавторизованного ПО. Так как инсайдер пытался развернуть на машине инфостилер, нацеленный на данные, хранящиеся в браузерах, предполагается, что он надеялся извлечь информацию, оставшуюся в системе от прошлого владельца.", reference: "xaker.ru", image: "../assets/logo.svg" },
                    { id: 0, title: "На работу в компанию KnowBe4 устроился северокорейский хакер", tag: "#worldgroupactivity", date: "25072024", content: "KnowBe4 сообщает, что все началось с того, что ее команда безопасности обнаружила подозрительную активность, исходящую с рабочей станции недавно нанятого инженера-программиста Однако быстро выяснилось, что на самом деле инсайдер использовал Raspberry Pi для загрузки вредоносного ПО, манипулирования файлами сессий и выполнения неавторизованного ПО. Так как инсайдер пытался развернуть на машине инфостилер, нацеленный на данные, хранящиеся в браузерах, предполагается, что он надеялся извлечь информацию, оставшуюся в системе от прошлого владельца.", reference: "xaker.ru", image: "../assets/logo.svg" },
                    { id: 0, title: "На работу в компанию KnowBe4 устроился северокорейский хакер", tag: "#worldgroupactivity", date: "25072024", content: "KnowBe4 сообщает, что все началось с того, что ее команда безопасности обнаружила подозрительную активность, исходящую с рабочей станции недавно нанятого инженера-программиста Однако быстро выяснилось, что на самом деле инсайдер использовал Raspberry Pi для загрузки вредоносного ПО, манипулирования файлами сессий и выполнения неавторизованного ПО. Так как инсайдер пытался развернуть на машине инфостилер, нацеленный на данные, хранящиеся в браузерах, предполагается, что он надеялся извлечь информацию, оставшуюся в системе от прошлого владельца.", reference: "xaker.ru", image: "../assets/logo.svg" },
                    { id: 0, title: "На работу в компанию KnowBe4 устроился северокорейский хакер", tag: "#worldgroupactivity", date: "25072024", content: "KnowBe4 сообщает, что все началось с того, что ее команда безопасности обнаружила подозрительную активность, исходящую с рабочей станции недавно нанятого инженера-программиста Однако быстро выяснилось, что на самом деле инсайдер использовал Raspberry Pi для загрузки вредоносного ПО, манипулирования файлами сессий и выполнения неавторизованного ПО. Так как инсайдер пытался развернуть на машине инфостилер, нацеленный на данные, хранящиеся в браузерах, предполагается, что он надеялся извлечь информацию, оставшуюся в системе от прошлого владельца.", reference: "xaker.ru", image: "../assets/logo.svg" },
                   
                    ],
                chatcreatebutton: false,
                sentmessageinput: null,
            };
        },
        computed: {
            currentroutename() {
                return this.$route.path;
            }
        },
        created() {
            // fetch the data when the view is created and the data is
            // already being observed
            this.fetchData();
        },
        watch: {
            // call again the method if the route changes
            '$route': 'fetchData'
        },
        methods: {
            fetchData() {
                this.post = null;
                this.loading = true;

                /*fetch('news')
                    .then(r => r.json())
                    .then(json => {
                        this.post = json;
                        this.loading = false;

                        console.debug();
                        return;
                    });*/

            },
         
            login(){
                // test session expired
                // get new session id
                // set cookie
            },
                    
        },
    });
</script>